define("selfapply/data_industry.js",[],function(){
"use strict";
var a={
"健康医疗":["医院","药品","保健养生","整形整容","心理咨询","医疗健康相关"],
"文学出版":["文学","出版社","文学出版发行公司"],
"娱乐":["音乐","影视","娱乐产业"],
"财经":["经济学","理财","银行","会计","投资","基金","股票","外汇","期货","保险","其他"],
"传媒":["电视","电台","杂志","报纸","网络媒体","传媒公司"],
"游戏/动漫":["动漫","游戏","电子竞技"],
"育儿":["母婴","童书阅读","育儿早教"],
"住宿和餐饮":["酒店","住宿","餐饮","美食点评"],
"建筑装饰业":["装饰业","建筑业"],
"石油化工":["石油化工"],
"体育":["健身","体育行业公司","足球","篮球","羽毛球","网球","排球","高尔夫","游泳","武术搏击","体操","田径","赛车","体育相关"],
"IT互联网":["通信服务","电信","软件业","电子商务","互联网","网站","其他"],
"汽车":["汽车制造","汽车租赁","汽车维修与保养","驾校","汽车经销商","汽车周边","其他汽车相关"],
"科普":["天文","地理","动植物","气候","科普媒体/机构"],
"公益":["公益"],
"教育":["培训","大学","中学","小学","出国留学","学者专家"],
"交通运输":["城市公共交通","船舶运输","铁路运输"],
"制造业":["制造业"],
"电力":["电力"],
"时尚":["化妆造型","美容服饰","时尚设计","模特行业","星座"],
"人文艺术":["舞蹈","诗歌","书法","绘画","戏剧","摄影","历史","宗教","收藏","工艺","周易风水"],
"房地产":["房地产开发商","房地产中介","物业管理","房地产行业公司","房地产媒体"],
"农林牧渔业":["农林牧渔业"],
"商业服务业":["职业中介","营销","公关","广告","法律"],
"航空航天":["航空航天"],
"物流快递":["快递","物流"],
"旅游":["旅行社","旅游行业公司","旅游相关"],
"政府官员":["医疗卫生","公安","交通","司法","招商","旅游","工商税务","纪检监察","官员","团委","政府"],
"军事航空":["军事航空"],
"居民服务业":["休闲娱乐","美容美发","健身","婚庆","宠物","摄影扩印","其他居民服务"],
"批发零售":["批发","零售"],
"社团协会":["社团协会"],
"其他行业":["其他行业"]
},r=[];
for(var n in a)r.push({
name:n,
value:n
});
var e=[];
for(var n in a){
for(var u=[],t=0;t<a[n].length;t++)u.push({
name:a[n][t],
value:a[n][t]
});
e[n]=u;
}
return{
industry:r,
occupation:e
};
});