define("register/data_bank_city.js",[],function(){
"use strict";
var e={
"北京市":["北京市"],
"安徽省":["黄山市","马鞍山市","宣城市","铜陵市","淮南市","巢湖地区","芜湖市","六安地区","阜阳市","池州地区","安庆市","合肥市","滁州市","亳州市","淮北市","蚌埠市","宿州市"],
"重庆市 ":["重庆市","巫溪县","大足县","奉节县","石柱土家族","綦江县","丰都县","云阳县","彭水苗族","荣昌县","酉阳土家族","双桥市","垫江县","江津市","开县","万州市","璧山县","巫山县","忠县","万盛市","永川市","潼南县","铜梁县","武隆县","黔江市","长寿市","合川市","南川市","梁平县","秀山土家族","城口县","涪陵市"],
"福建省":["南平市","莆田市","龙岩市","福州市","漳州市","三明市","宁德市","泉州市","厦门市"],
"广东省":["中山市","潮州市","肇庆市","湛江市","佛山市","珠海市","广州市","揭阳市","梅州市","深圳市","汕尾市","汕头市","江门市","茂名市","惠州市","河源市","东莞市","清远市","阳江市","韶关市","云浮市"],
"甘肃省":["定西地区","兰州市","玉门市","酒泉市","临夏州","张掖市","平凉地区","甘南州","武威市","庆阳地区","天水市","白银市","陇南地区","金昌市","嘉峪关市"],
"广西壮族自治区":["百色地区","南宁市","柳州市","来宾市","玉林市","防城港市","崇左市","梧州市","钦州市","北海市","桂林市","河池地区","贺州市","贵港市"],
"贵州省":["黔西南州","六盘水市","铜仁地区","贵阳市","黔南州","安顺地区","遵义市","毕节地区","黔东南州"],
"湖南省":["张家界市","益阳市","衡阳市","长沙市","永州市","岳阳市","邵阳市","娄底市","湘西土家族","湘潭市","常德市","株洲市","郴州市","怀化市"],
"海南省":["临高县","三亚市","乐东县","东方市","琼中县","保亭县","五指山市","白沙县","儋州市","定安县","琼山市","海口市","万宁市","琼海市","陵水县","澄迈县","屯昌县","文昌市","昌江县"],
"湖北省":["武汉市","秭归县","五峰县","潜江市","枝江市","仙桃市","兴山县","大冶市","当阳市","神农架林区","黄冈市","荆门市","咸宁市","鄂州市","宜都市","宜昌市","远安县","长阳县","随州市","十堰市","孝感市","襄樊市","黄石市","荆州市","恩施州","天门市"],
"河北省":["石家庄市","邯郸市","鹿泉市","保定市","唐山市","衡水市","张家口市","廊坊市","秦皇岛市","邢台市","承德市","沧州市"],
"黑龙江省":["齐齐哈尔市","鸡西市","大兴安岭","尚志市","双鸭山市","绥化市","大庆市","延寿县","佳木斯市","巴彦县","木兰县","依兰县","绥化","哈尔滨市","通河县","牡丹江市","七台河市","伊春市","方正县","黑河市","鹤岗市","五常市"],
"河南省":["郑州市","三门峡市","开封市","洛阳市","南阳市","鹤壁市","平顶山市","濮阳市","驻马店市","焦作市","周口市","漯河市","许昌市","信阳市","安阳市","新乡市","商丘市"],
"天津市":["天津市"],
"西藏自治区":["那曲地区","阿里地区","山南地区","昌都地区","日喀则地区","拉萨市","樟木口岸","林芝地区"],
"青海省":["黄南州","果洛州","海东地区","西宁市","海北州","海南州","海西州","格尔木市","玉树州"],
"浙江省":["嘉兴市","诸暨市","温州市","台州市","衢州市","丽水市","宁波市","杭州市","舟山市","金华市","义乌市","湖州市","绍兴市"],
"辽宁省":["盘锦市","大连市","抚顺市","本溪市","沈阳市","锦州市","丹东市","铁岭市","葫芦岛市","辽阳市","营口市","鞍山市","朝阳市","阜新市"],
"江西省":["上饶市","景德镇市","萍乡市","鹰潭市","赣州市","吉安地区","新余市","抚州地区","南昌市","九江市","宜春地区"],
"新疆维吾尔自治区":["乌鲁木齐市","吐鲁番地区","博尔塔拉","五家渠市","塔城地区","昌吉回族","阿拉尔市","阿勒泰地区","阿克苏地区","巴音郭楞","克孜勒","伊犁哈萨克","和田地区","库尔勒市","石河子市","喀什地区","哈密地区","克拉玛依市","图木舒克市"],
"陕西省":["西安市","榆林市","宝鸡市","商洛市","铜川市","汉中市","安康市","延安市","渭南市","咸阳市"],
"江苏省":["江阴市","镇江市","徐州市","张家港市","宿迁市","南京市","连云港市","常州市","泰州市","无锡市","扬州市","盐城市","淮安市","苏州市","南通市"],
"吉林省":["吉林市","白城市","延边自治州","松原市","白山市","四平市","通化市","辽源市","长春市"],
"云南省":["丽江市","保山地区","昆明市","曲靖市","怒江州","临沧地区","西双版纳州","思茅地区","红河州","迪庆州","楚雄州","昭通地区","大理州","文山州","玉溪市","德宏州"],
"宁夏回族自治区":["吴忠市","固原地区","石嘴山市","银川市"],
"上海市":["上海市"],
"山东省":["泰安市","菏泽地区","济宁市","滨州市","烟台市","德州市","东营市","日照市","威海市","聊城市","潍坊市","临沂市","枣庄市","莱芜市","淄博市","青岛市","济南市"],
"四川省":["遂宁市","阿坝州","达川市","资阳地区","广安市","宜宾市","雅安地区","泸州市","内江市","乐山市","自贡市","南充市","德阳市","甘孜州","广元市","绵阳市","攀枝花市","成都市","眉山市","凉山州","巴中地区"],
"山西省":["大同市","长治市","太原市","运城市","朔州市","吕梁市","榆次市","晋中市","晋城市","忻州市","阳泉市","临汾市"],
"内蒙古自治区":["呼伦贝尔市","赤峰市","呼和浩特市","伊克昭盟","锡林郭勒盟","阿拉善盟市","巴彦淖尔盟","哲里木盟","包头市","乌兰察布盟","鄂尔多斯市","通辽市","兴安盟","乌海市"]
},r=[],a={};
for(var n in e){
r.push({
name:n,
value:n
}),a[n]=[];
for(var t=0;t<e[n].length;t++)a[n].push({
name:e[n][t],
value:e[n][t]
});
}
return{
province:r,
city:a
};
});